---
kind: type
id: T:Autodesk.Revit.DB.LoadedFamilyIntegrityCheck
source: html/c2f2587e-cd5b-8727-5243-67e19ce34ac6.htm
---
# Autodesk.Revit.DB.LoadedFamilyIntegrityCheck

Functions for checking the integrity of loaded families.

## Syntax (C#)
```csharp
public static class LoadedFamilyIntegrityCheck
```